cask_args appdir: "/Applications"

# taps
tap "sqldef/sqldef"

# core utilities
brew "gnu-sed"
brew "coreutils"
brew "watch"
brew "xz"
brew "jq"
brew "tree"

# development tools
brew "git"
brew "git-lfs"
brew "gh"
brew "mise"
brew "rustup"
brew "awscli"
brew "aws-nuke"

# AI tools
cask "codex"

# database tools
brew "mysql@8.0"
brew "postgresql@16"
brew "redis"
brew "mysqldef"
brew "psqldef"

# development utilities
brew "imagemagick"
brew "cocoapods"
brew "xcodegen"

# docker
# Docker Desktop includes Docker Engine + CLI + Compose
# so standalone docker/docker-compose via brew are disabled

# brew "docker"
# brew "docker-compose"
cask "docker-desktop"

# terminal
cask "iterm2"
cask "ghostty"

# other applications
cask "session-manager-plugin"
cask "google-japanese-ime"