cask_args appdir: "/Applications"

brew "volta"
brew "docker"
brew "go"
brew "xz"
brew "pyenv"
brew "sqldef/sqldef/mysqldef"
brew "sqldef/sqldef/psqldef"
brew "docker-compose"
brew "awscli"
brew "jenv"
brew "openjdk@17"
brew "git"
brew "redis"
brew "mysql@8.0"
brew "gradle"
brew "jq"
brew "tree"
brew "postgresql@16"
brew "aws-nuke"
brew "rustup-init"
brew "gh"
brew "imagemagick"
brew "cocoapods"

cask "session-manager-plugin"
cask "corretto@21"
cask "google-japanese-ime"