cask_args appdir: "/Applications"

tap "sqldef/sqldef"

brew "docker"
brew "xz"
brew "mysqldef"
brew "psqldef"
brew "docker-compose"
brew "awscli"
brew "git"
brew "redis"
brew "mysql@8.0"
brew "jq"
brew "tree"
brew "postgresql@16"
brew "aws-nuke"
brew "rustup-init"
brew "gh"
brew "imagemagick"
brew "cocoapods"
brew "xcodegen"
brew "mise"

cask "session-manager-plugin"
cask "google-japanese-ime"